w7/w7d2_music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token]
        @current_user ||= User.find_by(session_token: session[:session_token]) ## what about users[:session_token]??