w6/w6d3_FirstRoutesAndControllers/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def show
        # the params should show us this specific user
        render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]