w6/w6d3_4_FirstRoutesAndControllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        # render json: User.find(params[:id])
        render json: User.find(params[:id])