w6/w6d5_99Cats/app/controllers/cats_controller.rb

    def show
        @cat = Cat.find(params[:id]) #find_by(:id, params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]